---
kind: method
id: M:Autodesk.Revit.DB.EdgeArray.GetEnumerator
source: html/c10d6202-4f95-ff5e-e242-2b6caf5b682d.htm
---
# Autodesk.Revit.DB.EdgeArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.